yunvfeng/smart-car/libraries/zf_common/stc32g144k246.h
sfr         USBCLK      =           0xdc;

sfr         T3T4M       =           0xdd;
sfr         T4T3M       =           0xdd;
    sbit    T4R         =           T4T3M^7;
    sbit    T4_CT       =           T4T3M^6;
    sbit    T4x12       =           T4T3M^5;
    sbit    T4CLKO      =           T4T3M^4;
    sbit    T3R         =           T4T3M^3;
    sbit    T3_CT       =           T4T3M^2;
    sbit    T3x12       =           T4T3M^1;
    sbit    T3CLKO      =           T4T3M^0;

sfr         ADCCFG      =           0xde;
    sbit    RESFMT      =           ADCCFG^5;

sfr         IP3         =           0xdf;
    sbit    PI2S        =           IP3^3;
    sbit    PRTC        =           IP3^2;
    sbit    PS4         =           IP3^1;
    sbit    PS3         =           IP3^0;

sfr         ACC         =           0xE0;
    sbit    ACC0        =           ACC^0;
    sbit    ACC1        =           ACC^1;
    sbit    ACC2        =           ACC^2;
    sbit    ACC3        =           ACC^3;
    sbit    ACC4        =           ACC^4;
    sbit    ACC5        =           ACC^5;
    sbit    ACC6        =           ACC^6;
    sbit    ACC7        =           ACC^7;

sfr         P7M1        =           0xe1;
sfr         P7M0        =           0xe2;
sfr         DPS         =           0xe3;

sfr         CMPCR1      =           0xe6;
    sbit    CMPEN       =           CMPCR1^7;
    sbit    CMPIF       =           CMPCR1^6;
    sbit    PIE         =           CMPCR1^5;
    sbit    NIE         =           CMPCR1^4;
    sbit    CMPOE       =           CMPCR1^1;
    sbit    CMPRES      =           CMPCR1^0;

sfr         CMPCR2      =           0xe7;
    sbit    INVCMPO     =           CMPCR2^7;
    sbit    DISFLT      =           CMPCR2^6;

sfr         P6          =           0xe8;
    sbit    P60         =           P6^0;
    sbit    P61         =           P6^1;
    sbit    P62         =           P6^2;
    sbit    P63         =           P6^3;
    sbit    P64         =           P6^4;
    sbit    P65         =           P6^5;
    sbit    P66         =           P6^6;
    sbit    P67         =           P6^7;

sfr         WTST        =           0xe9;
sfr         CKCON       =           0xea;
    sbit    RAMEXE      =           CKCON^7;

sfr         MXAX        =           0xeb;
sfr         USBDAT      =           0xec;
sfr         DMAIR       =           0xed;

sfr         IP3H        =           0xee;
    sbit    PI2SH       =           IP3H^3;
    sbit    PRTCH       =           IP3H^2;
    sbit    PS4H        =           IP3H^1;
    sbit    PS3H        =           IP3H^0;

sfr         AUXINTIF    =           0xef;
    sbit    INT4IF      =           AUXINTIF^6;
    sbit    INT3IF      =           AUXINTIF^5;
    sbit    INT2IF      =           AUXINTIF^4;
    sbit    T4IF        =           AUXINTIF^2;
    sbit    T3IF        =           AUXINTIF^1;
    sbit    T2IF        =           AUXINTIF^0;

sfr         B           =           0xF0;
    sbit    B0          =           B^0;
    sbit    B1          =           B^1;
    sbit    B2          =           B^2;
    sbit    B3          =           B^3;
    sbit    B4          =           B^4;
    sbit    B5          =           B^5;
    sbit    B6          =           B^6;
    sbit    B7          =           B^7;

sfr         USBCON      =           0xf4;
    sbit    ENUSB       =           USBCON^7;
    sbit    ENUSBRST    =           USBCON^6;
    sbit    PS2M        =           USBCON^5;
    sbit    PUEN        =           USBCON^4;
    sbit    PDEN        =           USBCON^3;
    sbit    DFREC       =           USBCON^2;
    sbit    DP          =           USBCON^1;
    sbit    DM          =           USBCON^0;

sfr         IAP_TPS     =           0xf5;
sfr         IAP_ADDRE   =           0xf6;

sfr         P7          =           0xf8;
    sbit    P70         =           P7^0;
    sbit    P71         =           P7^1;
    sbit    P72         =           P7^2;
    sbit    P73         =           P7^3;
    sbit    P74         =           P7^4;
    sbit    P75         =           P7^5;
    sbit    P76         =           P7^6;
    sbit    P77         =           P7^7;

sfr         LINICR      =           0xf9;
sbit        PLINH       =           LINICR^3;
sbit        LINIF       =           LINICR^2;
sbit        LINIE       =           LINICR^1;
sbit        PLINL       =           LINICR^0;
sfr         LINAR       =           0xfa;
sfr         LINDR       =           0xfb;
sfr         USBADR      =           0xfc;

sfr         S4CON       =           0xfd;
    sbit    S4SM0       =           S4CON^7;
    sbit    S4ST4       =           S4CON^6;
    sbit    S4SM2       =           S4CON^5;
    sbit    S4REN       =           S4CON^4;
    sbit    S4TB8       =           S4CON^3;
    sbit    S4RB8       =           S4CON^2;
    sbit    S4TI        =           S4CON^1;
    sbit    S4RI        =           S4CON^0;

sfr         S4BUF       =           0xfe;

sfr         RSTCFG      =           0xff;
    sbit    ENLVR       =           RSTCFG^6;
    sbit    P54RST      =           RSTCFG^4;

/////////////////////////////////////////////////
//
//如下特殊功能寄存器位于扩展RAM区域
//访问这些寄存�?需先将EAXFR设置�?,才可正常读写
//    EAXFR = 1;
//或�?
//    P_SW2 |= 0x80;
///////////////////////////////////////////////////

/////////////////////////////////////////////////
//7E:FF00H-7E:FFFFH
/////////////////////////////////////////////////



/////////////////////////////////////////////////
//7E:FE00H-7E:FEFFH
/////////////////////////////////////////////////

#define     CLKSEL                  (*(unsigned char volatile far *)0x7efe00)
#define     CLKDIV                  (*(unsigned char volatile far *)0x7efe01)
#define     HIRCCR                  (*(unsigned char volatile far *)0x7efe02)
#define     XOSCCR                  (*(unsigned char volatile far *)0x7efe03)
#define     IRC32KCR                (*(unsigned char volatile far *)0x7efe04)
#define     MCLKOCR                 (*(unsigned char volatile far *)0x7efe05)
#define     IRCDB                   (*(unsigned char volatile far *)0x7efe06)
#define     IRC48MCR                (*(unsigned char volatile far *)0x7efe07)
#define     X32KCR                  (*(unsigned char volatile far *)0x7efe08)
#define     IRC48MATRIM             (*(unsigned char volatile far *)0x7efe09)
#define     IRC48MBTRIM             (*(unsigned char volatile far *)0x7efe0a)
#define     HSCLKDIV                (*(unsigned char volatile far *)0x7efe0b)
#define     HPLLCR                  (*(unsigned char volatile far *)0x7efe0c)
#define     HPLLPDIV                (*(unsigned char volatile far *)0x7efe0d)
#define     HPLL2CR                 (*(unsigned char volatile far *)0x7efe0e)
#define     HPLL2PDIV               (*(unsigned char volatile far *)0x7efe0f)

#define     P0PU                    (*(unsigned char volatile far *)0x7efe10)
#define     P1PU                    (*(unsigned char volatile far *)0x7efe11)
#define     P2PU                    (*(unsigned char volatile far *)0x7efe12)
#define     P3PU                    (*(unsigned char volatile far *)0x7efe13)
#define     P4PU                    (*(unsigned char volatile far *)0x7efe14)
#define     P5PU                    (*(unsigned char volatile far *)0x7efe15)
#define     P6PU                    (*(unsigned char volatile far *)0x7efe16)
#define     P7PU                    (*(unsigned char volatile far *)0x7efe17)

