yunvfeng/smart-car/libraries/zf_common/stc32g144k246.h
#define     PWMB_CR1                (*(unsigned char volatile far *)0x7efee0)
#define     PWMB_CR2                (*(unsigned char volatile far *)0x7efee1)
#define     PWMB_SMCR               (*(unsigned char volatile far *)0x7efee2)
#define     PWMB_ETR                (*(unsigned char volatile far *)0x7efee3)
#define     PWMB_IER                (*(unsigned char volatile far *)0x7efee4)
#define     PWMB_SR1                (*(unsigned char volatile far *)0x7efee5)
#define     PWMB_SR2                (*(unsigned char volatile far *)0x7efee6)
#define     PWMB_EGR                (*(unsigned char volatile far *)0x7efee7)
#define     PWMB_CCMR1              (*(unsigned char volatile far *)0x7efee8)
#define     PWMB_CCMR2              (*(unsigned char volatile far *)0x7efee9)
#define     PWMB_CCMR3              (*(unsigned char volatile far *)0x7efeea)
#define     PWMB_CCMR4              (*(unsigned char volatile far *)0x7efeeb)
#define     PWMB_CCER1              (*(unsigned char volatile far *)0x7efeec)
#define     PWMB_CCER2              (*(unsigned char volatile far *)0x7efeed)
#define     PWMB_CNTRH              (*(unsigned char volatile far *)0x7efeee)
#define     PWMB_CNTRL              (*(unsigned char volatile far *)0x7efeef)
#define     PWMB_PSCRH              (*(unsigned char volatile far *)0x7efef0)
#define     PWMB_PSCRL              (*(unsigned char volatile far *)0x7efef1)
#define     PWMB_ARRH               (*(unsigned char volatile far *)0x7efef2)
#define     PWMB_ARRL               (*(unsigned char volatile far *)0x7efef3)
#define     PWMB_RCR                (*(unsigned char volatile far *)0x7efef4)
#define     PWMB_CCR5H              (*(unsigned char volatile far *)0x7efef5)
#define     PWMB_CCR5L              (*(unsigned char volatile far *)0x7efef6)
#define     PWMB_CCR6H              (*(unsigned char volatile far *)0x7efef7)
#define     PWMB_CCR6L              (*(unsigned char volatile far *)0x7efef8)
#define     PWMB_CCR7H              (*(unsigned char volatile far *)0x7efef9)
#define     PWMB_CCR7L              (*(unsigned char volatile far *)0x7efefa)
#define     PWMB_CCR8H              (*(unsigned char volatile far *)0x7efefb)
#define     PWMB_CCR8L              (*(unsigned char volatile far *)0x7efefc)
#define     PWMB_BKR                (*(unsigned char volatile far *)0x7efefd)
#define     PWMB_DTR                (*(unsigned char volatile far *)0x7efefe)
#define     PWMB_OISR               (*(unsigned char volatile far *)0x7efeff)

/////////////////////////////////////////////////
//7E:FD00H-7E:FDFFH
/////////////////////////////////////////////////

#define     P0INTE                  (*(unsigned char volatile far *)0x7efd00)
#define     P1INTE                  (*(unsigned char volatile far *)0x7efd01)
#define     P2INTE                  (*(unsigned char volatile far *)0x7efd02)
#define     P3INTE                  (*(unsigned char volatile far *)0x7efd03)
#define     P4INTE                  (*(unsigned char volatile far *)0x7efd04)
#define     P5INTE                  (*(unsigned char volatile far *)0x7efd05)
#define     P6INTE                  (*(unsigned char volatile far *)0x7efd06)
#define     P7INTE                  (*(unsigned char volatile far *)0x7efd07)
#define     P8INTE                  (*(unsigned char volatile far *)0x7efd08)
#define     P9INTE                  (*(unsigned char volatile far *)0x7efd09)
#define     PAINTE                  (*(unsigned char volatile far *)0x7efd0a)
#define     PBINTE                  (*(unsigned char volatile far *)0x7efd0b)
#define     PCINTE                  (*(unsigned char volatile far *)0x7efd0c)
#define     PDINTE                  (*(unsigned char volatile far *)0x7efd0d)
#define     PEINTE                  (*(unsigned char volatile far *)0x7efd0e)
#define     PFINTE                  (*(unsigned char volatile far *)0x7efd0f)

#define     P0INTF                  (*(unsigned char volatile far *)0x7efd10)
#define     P1INTF                  (*(unsigned char volatile far *)0x7efd11)
#define     P2INTF                  (*(unsigned char volatile far *)0x7efd12)
#define     P3INTF                  (*(unsigned char volatile far *)0x7efd13)
#define     P4INTF                  (*(unsigned char volatile far *)0x7efd14)
#define     P5INTF                  (*(unsigned char volatile far *)0x7efd15)
#define     P6INTF                  (*(unsigned char volatile far *)0x7efd16)
#define     P7INTF                  (*(unsigned char volatile far *)0x7efd17)
#define     P8INTF                  (*(unsigned char volatile far *)0x7efd18)
#define     P9INTF                  (*(unsigned char volatile far *)0x7efd19)
#define     PAINTF                  (*(unsigned char volatile far *)0x7efd1a)
#define     PBINTF                  (*(unsigned char volatile far *)0x7efd1b)
#define     PCINTF                  (*(unsigned char volatile far *)0x7efd1c)
#define     PDINTF                  (*(unsigned char volatile far *)0x7efd1d)
#define     PEINTF                  (*(unsigned char volatile far *)0x7efd1e)
#define     PFINTF                  (*(unsigned char volatile far *)0x7efd1f)

#define     P0IM0                   (*(unsigned char volatile far *)0x7efd20)
#define     P1IM0                   (*(unsigned char volatile far *)0x7efd21)
#define     P2IM0                   (*(unsigned char volatile far *)0x7efd22)
#define     P3IM0                   (*(unsigned char volatile far *)0x7efd23)
#define     P4IM0                   (*(unsigned char volatile far *)0x7efd24)
#define     P5IM0                   (*(unsigned char volatile far *)0x7efd25)
#define     P6IM0                   (*(unsigned char volatile far *)0x7efd26)
#define     P7IM0                   (*(unsigned char volatile far *)0x7efd27)
#define     P8IM0                   (*(unsigned char volatile far *)0x7efd28)
#define     P9IM0                   (*(unsigned char volatile far *)0x7efd29)
#define     PAIM0                   (*(unsigned char volatile far *)0x7efd2a)
#define     PBIM0                   (*(unsigned char volatile far *)0x7efd2b)
#define     PCIM0                   (*(unsigned char volatile far *)0x7efd2c)
#define     PDIM0                   (*(unsigned char volatile far *)0x7efd2d)
#define     PEIM0                   (*(unsigned char volatile far *)0x7efd2e)
#define     PFIM0                   (*(unsigned char volatile far *)0x7efd2f)

#define     P0IM1                   (*(unsigned char volatile far *)0x7efd30)
#define     P1IM1                   (*(unsigned char volatile far *)0x7efd31)
#define     P2IM1                   (*(unsigned char volatile far *)0x7efd32)
#define     P3IM1                   (*(unsigned char volatile far *)0x7efd33)
#define     P4IM1                   (*(unsigned char volatile far *)0x7efd34)
#define     P5IM1                   (*(unsigned char volatile far *)0x7efd35)
#define     P6IM1                   (*(unsigned char volatile far *)0x7efd36)
#define     P7IM1                   (*(unsigned char volatile far *)0x7efd37)
#define     P8IM1                   (*(unsigned char volatile far *)0x7efd38)
#define     P9IM1                   (*(unsigned char volatile far *)0x7efd39)
#define     PAIM1                   (*(unsigned char volatile far *)0x7efd3a)
#define     PBIM1                   (*(unsigned char volatile far *)0x7efd3b)
#define     PCIM1                   (*(unsigned char volatile far *)0x7efd3c)
#define     PDIM1                   (*(unsigned char volatile far *)0x7efd3d)
#define     PEIM1                   (*(unsigned char volatile far *)0x7efd3e)
#define     PFIM1                   (*(unsigned char volatile far *)0x7efd3f)

#define     P0WKUE                  (*(unsigned char volatile far *)0x7efd40)
#define     P1WKUE                  (*(unsigned char volatile far *)0x7efd41)
#define     P2WKUE                  (*(unsigned char volatile far *)0x7efd42)
#define     P3WKUE                  (*(unsigned char volatile far *)0x7efd43)
#define     P4WKUE                  (*(unsigned char volatile far *)0x7efd44)
#define     P5WKUE                  (*(unsigned char volatile far *)0x7efd45)
#define     P6WKUE                  (*(unsigned char volatile far *)0x7efd46)
#define     P7WKUE                  (*(unsigned char volatile far *)0x7efd47)
#define     P8WKUE                  (*(unsigned char volatile far *)0x7efd48)
#define     P9WKUE                  (*(unsigned char volatile far *)0x7efd49)
#define     PAWKUE                  (*(unsigned char volatile far *)0x7efd4a)
#define     PBWKUE                  (*(unsigned char volatile far *)0x7efd4b)
#define     PCWKUE                  (*(unsigned char volatile far *)0x7efd4c)
#define     PDWKUE                  (*(unsigned char volatile far *)0x7efd4d)
#define     PEWKUE                  (*(unsigned char volatile far *)0x7efd4e)
#define     PFWKUE                  (*(unsigned char volatile far *)0x7efd4f)

