yunvfeng/smart-car/libraries/zf_common/stc32g144k246.h
#define     PINIPL                  (*(unsigned char volatile far *)0x7efd60)
#define     PINIPH                  (*(unsigned char volatile far *)0x7efd61)
#define     PIN2IPL                 (*(unsigned char volatile far *)0x7efd62)
#define     PIN2IPH                 (*(unsigned char volatile far *)0x7efd63)

#define     P_SWX1                  (*(unsigned char volatile far *)0x7efd69)
#define     P_SWX2                  (*(unsigned char volatile far *)0x7efd6a)
#define     P_SWX3                  (*(unsigned char volatile far *)0x7efd6b)
#define     P_SWX4                  (*(unsigned char volatile far *)0x7efd6c)
#define     P_SWX5                  (*(unsigned char volatile far *)0x7efd6d)
#define     P_SWX6                  (*(unsigned char volatile far *)0x7efd6e)
#define     P_SWX7                  (*(unsigned char volatile far *)0x7efd6f)

#define     UR1TOCR                 (*(unsigned char volatile far *)0x7efd70)
#define     UR1TOSR                 (*(unsigned char volatile far *)0x7efd71)
#define     UR1TOTH                 (*(unsigned char volatile far *)0x7efd72)
#define     UR1TOTL                 (*(unsigned char volatile far *)0x7efd73)
#define     UR2TOCR                 (*(unsigned char volatile far *)0x7efd74)
#define     UR2TOSR                 (*(unsigned char volatile far *)0x7efd75)
#define     UR2TOTH                 (*(unsigned char volatile far *)0x7efd76)
#define     UR2TOTL                 (*(unsigned char volatile far *)0x7efd77)
#define     UR3TOCR                 (*(unsigned char volatile far *)0x7efd78)
#define     UR3TOSR                 (*(unsigned char volatile far *)0x7efd79)
#define     UR3TOTH                 (*(unsigned char volatile far *)0x7efd7a)
#define     UR3TOTL                 (*(unsigned char volatile far *)0x7efd7b)
#define     UR4TOCR                 (*(unsigned char volatile far *)0x7efd7c)
#define     UR4TOSR                 (*(unsigned char volatile far *)0x7efd7d)
#define     UR4TOTH                 (*(unsigned char volatile far *)0x7efd7e)
#define     UR4TOTL                 (*(unsigned char volatile far *)0x7efd7f)
#define     SPITOCR                 (*(unsigned char volatile far *)0x7efd80)
#define     SPITOSR                 (*(unsigned char volatile far *)0x7efd81)
#define     SPITOTH                 (*(unsigned char volatile far *)0x7efd82)
#define     SPITOTL                 (*(unsigned char volatile far *)0x7efd83)
#define     I2CTOCR                 (*(unsigned char volatile far *)0x7efd84)
#define     I2CTOSR                 (*(unsigned char volatile far *)0x7efd85)
#define     I2CTOTH                 (*(unsigned char volatile far *)0x7efd86)
#define     I2CTOTL                 (*(unsigned char volatile far *)0x7efd87)

#define     UR1TOTE                 (*(unsigned char volatile far *)0x7efd88)
#define     UR2TOTE                 (*(unsigned char volatile far *)0x7efd89)
#define     UR3TOTE                 (*(unsigned char volatile far *)0x7efd8a)
#define     UR4TOTE                 (*(unsigned char volatile far *)0x7efd8b)
#define     SPITOTE                 (*(unsigned char volatile far *)0x7efd8c)
#define     I2CTOTE                 (*(unsigned char volatile far *)0x7efd8d)

#define     I2S2CR                  (*(unsigned char volatile far *)0x7efd90)
#define     I2S2SR                  (*(unsigned char volatile far *)0x7efd91)
#define     I2S2DRH                 (*(unsigned char volatile far *)0x7efd92)
#define     I2S2DRL                 (*(unsigned char volatile far *)0x7efd93)
#define     I2S2PRH                 (*(unsigned char volatile far *)0x7efd94)
#define     I2S2PRL                 (*(unsigned char volatile far *)0x7efd95)
#define     I2S2CFGH                (*(unsigned char volatile far *)0x7efd96)
#define     I2S2CFGL                (*(unsigned char volatile far *)0x7efd97)

#define     I2SCR                   (*(unsigned char volatile far *)0x7efd98)
#define     I2SSR                   (*(unsigned char volatile far *)0x7efd99)
#define     I2SDRH                  (*(unsigned char volatile far *)0x7efd9a)
#define     I2SDRL                  (*(unsigned char volatile far *)0x7efd9b)
#define     I2SPRH                  (*(unsigned char volatile far *)0x7efd9c)
#define     I2SPRL                  (*(unsigned char volatile far *)0x7efd9d)
#define     I2SCFGH                 (*(unsigned char volatile far *)0x7efd9e)
#define     I2SCFGL                 (*(unsigned char volatile far *)0x7efd9f)
#define     I2SMD                   (*(unsigned char volatile far *)0x7efda0)
#define     I2SMCKDIV               (*(unsigned char volatile far *)0x7efda1)
#define     I2SINSEL                (*(unsigned char volatile far *)0x7efda2)

#define     I2S2MD                  (*(unsigned char volatile far *)0x7efda4)
#define     I2S2MCKDIV              (*(unsigned char volatile far *)0x7efda5)
#define     I2S2INSEL               (*(unsigned char volatile far *)0x7efda6)

#define     CRECR                   (*(unsigned char volatile far *)0x7efda8)
#define     CRECNTH                 (*(unsigned char volatile far *)0x7efda9)
#define     CRECNTL                 (*(unsigned char volatile far *)0x7efdaa)
#define     CRERES                  (*(unsigned char volatile far *)0x7efdab)
#define     CRECFG                  (*(unsigned char volatile far *)0x7efdac)

#define     S2CFG                   (*(unsigned char volatile far *)0x7efdb4)
#define     S2ADDR                  (*(unsigned char volatile far *)0x7efdb5)
#define     S2ADEN                  (*(unsigned char volatile far *)0x7efdb6)

#define     S3CFG                   (*(unsigned char volatile far *)0x7efdb8)
#define     S3ADDR                  (*(unsigned char volatile far *)0x7efdb9)
#define     S3ADEN                  (*(unsigned char volatile far *)0x7efdba)

#define     S4CFG                   (*(unsigned char volatile far *)0x7efdbc)
#define     S4ADDR                  (*(unsigned char volatile far *)0x7efdbd)
#define     S4ADEN                  (*(unsigned char volatile far *)0x7efdbe)

#define     USARTCR1                (*(unsigned char volatile far *)0x7efdc0)
#define     USARTCR2                (*(unsigned char volatile far *)0x7efdc1)
#define     USARTCR3                (*(unsigned char volatile far *)0x7efdc2)
#define     USARTCR4                (*(unsigned char volatile far *)0x7efdc3)
#define     USARTCR5                (*(unsigned char volatile far *)0x7efdc4)
#define     USARTGTR                (*(unsigned char volatile far *)0x7efdc5)
#define     USARTBRH                (*(unsigned char volatile far *)0x7efdc6)
#define     USARTBRL                (*(unsigned char volatile far *)0x7efdc7)

