yunvfeng/smart-car/libraries/zf_common/stc32g144k246.h
#define     USART2CR1               (*(unsigned char volatile far *)0x7efdc8)
#define     USART2CR2               (*(unsigned char volatile far *)0x7efdc9)
#define     USART2CR3               (*(unsigned char volatile far *)0x7efdca)
#define     USART2CR4               (*(unsigned char volatile far *)0x7efdcb)
#define     USART2CR5               (*(unsigned char volatile far *)0x7efdcc)
#define     USART2GTR               (*(unsigned char volatile far *)0x7efdcd)
#define     USART2BRH               (*(unsigned char volatile far *)0x7efdce)
#define     USART2BRL               (*(unsigned char volatile far *)0x7efdcf)

#define     USART3CR1               (*(unsigned char volatile far *)0x7efdd0)
#define     USART3CR2               (*(unsigned char volatile far *)0x7efdd1)
#define     USART3CR3               (*(unsigned char volatile far *)0x7efdd2)
#define     USART3CR4               (*(unsigned char volatile far *)0x7efdd3)
#define     USART3CR5               (*(unsigned char volatile far *)0x7efdd4)
#define     USART3GTR               (*(unsigned char volatile far *)0x7efdd5)
#define     USART3BRH               (*(unsigned char volatile far *)0x7efdd6)
#define     USART3BRL               (*(unsigned char volatile far *)0x7efdd7)

#define     USART4CR1               (*(unsigned char volatile far *)0x7efdd8)
#define     USART4CR2               (*(unsigned char volatile far *)0x7efdd9)
#define     USART4CR3               (*(unsigned char volatile far *)0x7efdda)
#define     USART4CR4               (*(unsigned char volatile far *)0x7efddb)
#define     USART4CR5               (*(unsigned char volatile far *)0x7efddc)
#define     USART4GTR               (*(unsigned char volatile far *)0x7efddd)
#define     USART4BRH               (*(unsigned char volatile far *)0x7efdde)
#define     USART4BRL               (*(unsigned char volatile far *)0x7efddf)

#define     CHIPID                  ( (unsigned char volatile far *)0x7efde0)

#define     CHIPID0                 (*(unsigned char volatile far *)0x7efde0)
#define     CHIPID1                 (*(unsigned char volatile far *)0x7efde1)
#define     CHIPID2                 (*(unsigned char volatile far *)0x7efde2)
#define     CHIPID3                 (*(unsigned char volatile far *)0x7efde3)
#define     CHIPID4                 (*(unsigned char volatile far *)0x7efde4)
#define     CHIPID5                 (*(unsigned char volatile far *)0x7efde5)
#define     CHIPID6                 (*(unsigned char volatile far *)0x7efde6)
#define     CHIPID7                 (*(unsigned char volatile far *)0x7efde7)
#define     CHIPID8                 (*(unsigned char volatile far *)0x7efde8)
#define     CHIPID9                 (*(unsigned char volatile far *)0x7efde9)
#define     CHIPID10                (*(unsigned char volatile far *)0x7efdea)
#define     CHIPID11                (*(unsigned char volatile far *)0x7efdeb)
#define     CHIPID12                (*(unsigned char volatile far *)0x7efdec)
#define     CHIPID13                (*(unsigned char volatile far *)0x7efded)
#define     CHIPID14                (*(unsigned char volatile far *)0x7efdee)
#define     CHIPID15                (*(unsigned char volatile far *)0x7efdef)
#define     CHIPID16                (*(unsigned char volatile far *)0x7efdf0)
#define     CHIPID17                (*(unsigned char volatile far *)0x7efdf1)
#define     CHIPID18                (*(unsigned char volatile far *)0x7efdf2)
#define     CHIPID19                (*(unsigned char volatile far *)0x7efdf3)
#define     CHIPID20                (*(unsigned char volatile far *)0x7efdf4)
#define     CHIPID21                (*(unsigned char volatile far *)0x7efdf5)
#define     CHIPID22                (*(unsigned char volatile far *)0x7efdf6)
#define     CHIPID23                (*(unsigned char volatile far *)0x7efdf7)
#define     CHIPID24                (*(unsigned char volatile far *)0x7efdf8)
#define     CHIPID25                (*(unsigned char volatile far *)0x7efdf9)
#define     CHIPID26                (*(unsigned char volatile far *)0x7efdfa)
#define     CHIPID27                (*(unsigned char volatile far *)0x7efdfb)
#define     CHIPID28                (*(unsigned char volatile far *)0x7efdfc)
#define     CHIPID29                (*(unsigned char volatile far *)0x7efdfd)
#define     CHIPID30                (*(unsigned char volatile far *)0x7efdfe)
#define     CHIPID31                (*(unsigned char volatile far *)0x7efdff)

/////////////////////////////////////////////////
//7E:FC00H-7E:FCFFH
/////////////////////////////////////////////////



/////////////////////////////////////////////////
//7E:FB00H-7E:FBFFH
/////////////////////////////////////////////////

#define     CRC_CR                  (*(unsigned char volatile far *)0x7efb30)
#define     CRC_DIN                 (*(unsigned char volatile far *)0x7efb31)
#define     CRC_DOH                 (*(unsigned char volatile far *)0x7efb32)
#define     CRC_DOL                 (*(unsigned char volatile far *)0x7efb33)
#define     CRC_DO0                 (*(unsigned char volatile far *)0x7efb32)
#define     CRC_DO1                 (*(unsigned char volatile far *)0x7efb33)
#define     CRC_DO2                 (*(unsigned char volatile far *)0x7efb34)
#define     CRC_DO3                 (*(unsigned char volatile far *)0x7efb35)

#define     ADC2_CONTR              (*(unsigned char volatile far *)0x7efb38)
#define     ADC2CFG                 (*(unsigned char volatile far *)0x7efb39)
#define     ADC2_RES                (*(unsigned char volatile far *)0x7efb3a)
#define     ADC2_RESL               (*(unsigned char volatile far *)0x7efb3b)
#define     ADC2TIM                 (*(unsigned char volatile far *)0x7efb3c)
#define     ADC2EXCFG               (*(unsigned char volatile far *)0x7efb3d)
#define     ADC2INTR                (*(unsigned char volatile far *)0x7efb3e)
#define     ADC2EXCFG2              (*(unsigned char volatile far *)0x7efb3f)

#define     CMP1_6P6N_CR1           (*(unsigned char volatile far *)0x7efb70)
#define     CMP1_6P6N_CR2           (*(unsigned char volatile far *)0x7efb71)
#define     CMP1_6P6N_CR3           (*(unsigned char volatile far *)0x7efb72)
#define     CMP1_6P6N_CR4           (*(unsigned char volatile far *)0x7efb73)
#define     CMP2_6P6N_CR1           (*(unsigned char volatile far *)0x7efb74)
#define     CMP2_6P6N_CR2           (*(unsigned char volatile far *)0x7efb75)
#define     CMP2_6P6N_CR3           (*(unsigned char volatile far *)0x7efb76)
#define     CMP2_6P6N_CR4           (*(unsigned char volatile far *)0x7efb77)
#define     CMP3_6P6N_CR1           (*(unsigned char volatile far *)0x7efb78)
#define     CMP3_6P6N_CR2           (*(unsigned char volatile far *)0x7efb79)
#define     CMP3_6P6N_CR3           (*(unsigned char volatile far *)0x7efb7a)
#define     CMP3_6P6N_CR4           (*(unsigned char volatile far *)0x7efb7b)
#define     CMP4_6P6N_CR1           (*(unsigned char volatile far *)0x7efb7c)
#define     CMP4_6P6N_CR2           (*(unsigned char volatile far *)0x7efb7d)
#define     CMP4_6P6N_CR3           (*(unsigned char volatile far *)0x7efb7e)
#define     CMP4_6P6N_CR4           (*(unsigned char volatile far *)0x7efb7f)

#define     TM5PS                   (*(unsigned char volatile far *)0x7efbb0)
#define     TM6PS                   (*(unsigned char volatile far *)0x7efbb1)
#define     T6T5CFG                 (*(unsigned char volatile far *)0x7efbb2)
#define     T6T5M                   (*(unsigned char volatile far *)0x7efbb3)
#define     T6H                     (*(unsigned char volatile far *)0x7efbb4)
#define     T6L                     (*(unsigned char volatile far *)0x7efbb5)
#define     T5H                     (*(unsigned char volatile far *)0x7efbb6)
#define     T5L                     (*(unsigned char volatile far *)0x7efbb7)

#define     TM7PS                   (*(unsigned char volatile far *)0x7efbb8)
#define     TM8PS                   (*(unsigned char volatile far *)0x7efbb9)
#define     T8T7CFG                 (*(unsigned char volatile far *)0x7efbba)
#define     T8T7M                   (*(unsigned char volatile far *)0x7efbbb)
#define     T8H                     (*(unsigned char volatile far *)0x7efbbc)
#define     T8L                     (*(unsigned char volatile far *)0x7efbbd)
#define     T7H                     (*(unsigned char volatile far *)0x7efbbe)
#define     T7L                     (*(unsigned char volatile far *)0x7efbbf)

#define     TM9PS                   (*(unsigned char volatile far *)0x7efbc0)
#define     TM10PS                  (*(unsigned char volatile far *)0x7efbc1)
#define     T10T9CFG                (*(unsigned char volatile far *)0x7efbc2)
#define     T10T9M                  (*(unsigned char volatile far *)0x7efbc3)
#define     T10H                    (*(unsigned char volatile far *)0x7efbc4)
#define     T10L                    (*(unsigned char volatile far *)0x7efbc5)
#define     T9H                     (*(unsigned char volatile far *)0x7efbc6)
#define     T9L                     (*(unsigned char volatile far *)0x7efbc7)

#define     TM17PS                  (*(unsigned char volatile far *)0x7efbc8)
#define     TM18PS                  (*(unsigned char volatile far *)0x7efbc9)
#define     T18T17CFG               (*(unsigned char volatile far *)0x7efbca)
#define     T18T17M                 (*(unsigned char volatile far *)0x7efbcb)
#define     T18H                    (*(unsigned char volatile far *)0x7efbcc)
#define     T18L                    (*(unsigned char volatile far *)0x7efbcd)
#define     T17H                    (*(unsigned char volatile far *)0x7efbce)
#define     T17L                    (*(unsigned char volatile far *)0x7efbcf)

#define     CHIPIDX                 ( (unsigned char volatile far *)0x7efbd0)

#define     CHIPIDX0                (*(unsigned char volatile far *)0x7efbd0)
#define     CHIPIDX1                (*(unsigned char volatile far *)0x7efbd1)
#define     CHIPIDX2                (*(unsigned char volatile far *)0x7efbd2)
#define     CHIPIDX3                (*(unsigned char volatile far *)0x7efbd3)
#define     CHIPIDX4                (*(unsigned char volatile far *)0x7efbd4)
#define     CHIPIDX5                (*(unsigned char volatile far *)0x7efbd5)
#define     CHIPIDX6                (*(unsigned char volatile far *)0x7efbd6)
#define     CHIPIDX7                (*(unsigned char volatile far *)0x7efbd7)
#define     CHIPIDX8                (*(unsigned char volatile far *)0x7efbd8)
#define     CHIPIDX9                (*(unsigned char volatile far *)0x7efbd9)
#define     CHIPIDX10               (*(unsigned char volatile far *)0x7efbda)
#define     CHIPIDX11               (*(unsigned char volatile far *)0x7efbdb)
#define     CHIPIDX12               (*(unsigned char volatile far *)0x7efbdc)
#define     CHIPIDX13               (*(unsigned char volatile far *)0x7efbdd)
#define     CHIPIDX14               (*(unsigned char volatile far *)0x7efbde)
#define     CHIPIDX15               (*(unsigned char volatile far *)0x7efbdf)
#define     CHIPIDX16               (*(unsigned char volatile far *)0x7efbe0)
#define     CHIPIDX17               (*(unsigned char volatile far *)0x7efbe1)
#define     CHIPIDX18               (*(unsigned char volatile far *)0x7efbe2)
#define     CHIPIDX19               (*(unsigned char volatile far *)0x7efbe3)
#define     CHIPIDX20               (*(unsigned char volatile far *)0x7efbe4)
#define     CHIPIDX21               (*(unsigned char volatile far *)0x7efbe5)
#define     CHIPIDX22               (*(unsigned char volatile far *)0x7efbe6)
#define     CHIPIDX23               (*(unsigned char volatile far *)0x7efbe7)
#define     CHIPIDX24               (*(unsigned char volatile far *)0x7efbe8)
#define     CHIPIDX25               (*(unsigned char volatile far *)0x7efbe9)
#define     CHIPIDX26               (*(unsigned char volatile far *)0x7efbea)
#define     CHIPIDX27               (*(unsigned char volatile far *)0x7efbeb)
#define     CHIPIDX28               (*(unsigned char volatile far *)0x7efbec)
#define     CHIPIDX29               (*(unsigned char volatile far *)0x7efbed)
#define     CHIPIDX30               (*(unsigned char volatile far *)0x7efbee)
#define     CHIPIDX31               (*(unsigned char volatile far *)0x7efbef)

#define     HSPWMA_CFG              (*(unsigned char volatile far *)0x7efbf0)
#define     HSPWMA_ADR              (*(unsigned char volatile far *)0x7efbf1)
#define     HSPWMA_DAT              (*(unsigned char volatile far *)0x7efbf2)
#define     HSPWMA_ADRH             (*(unsigned char volatile far *)0x7efbf3)
#define     HSPWMB_CFG              (*(unsigned char volatile far *)0x7efbf4)
#define     HSPWMB_ADR              (*(unsigned char volatile far *)0x7efbf5)
#define     HSPWMB_DAT              (*(unsigned char volatile far *)0x7efbf6)
#define     HSPWMB_ADRH             (*(unsigned char volatile far *)0x7efbf7)

