yunvfeng/smart-car/libraries/zf_common/stc32g144k246.h
#define     DMA_PWMCR_CFG           (*(unsigned char volatile far *)0x7ef9b0)
#define     DMA_PWMCR_CR            (*(unsigned char volatile far *)0x7ef9b1)
#define     DMA_PWMCR_STA           (*(unsigned char volatile far *)0x7ef9b2)
#define     DMA_PWMCR_AMTH          (*(unsigned char volatile far *)0x7ef9b4)
#define     DMA_PWMCR_AMT           (*(unsigned char volatile far *)0x7ef9b5)
#define     DMA_PWMCR_DONEH         (*(unsigned char volatile far *)0x7ef9b6)
#define     DMA_PWMCR_DONE          (*(unsigned char volatile far *)0x7ef9b7)
#define     DMA_PWMCR_RXAH          (*(unsigned char volatile far *)0x7ef9b8)
#define     DMA_PWMCR_RXAL          (*(unsigned char volatile far *)0x7ef9b9)

#define     P8PU                    (*(unsigned char volatile far *)0x7ef9c0)
#define     P9PU                    (*(unsigned char volatile far *)0x7ef9c1)
#define     PAPU                    (*(unsigned char volatile far *)0x7ef9c2)
#define     PBPU                    (*(unsigned char volatile far *)0x7ef9c3)
#define     PCPU                    (*(unsigned char volatile far *)0x7ef9c4)
#define     PDPU                    (*(unsigned char volatile far *)0x7ef9c5)
#define     PEPU                    (*(unsigned char volatile far *)0x7ef9c6)
#define     PFPU                    (*(unsigned char volatile far *)0x7ef9c7)

#define     P8NCS                   (*(unsigned char volatile far *)0x7ef9c8)
#define     P9NCS                   (*(unsigned char volatile far *)0x7ef9c9)
#define     PANCS                   (*(unsigned char volatile far *)0x7ef9ca)
#define     PBNCS                   (*(unsigned char volatile far *)0x7ef9cb)
#define     PCNCS                   (*(unsigned char volatile far *)0x7ef9cc)
#define     PDNCS                   (*(unsigned char volatile far *)0x7ef9cd)
#define     PENCS                   (*(unsigned char volatile far *)0x7ef9ce)
#define     PFNCS                   (*(unsigned char volatile far *)0x7ef9cf)

#define     P8SR                    (*(unsigned char volatile far *)0x7ef9d0)
#define     P9SR                    (*(unsigned char volatile far *)0x7ef9d1)
#define     PASR                    (*(unsigned char volatile far *)0x7ef9d2)
#define     PBSR                    (*(unsigned char volatile far *)0x7ef9d3)
#define     PCSR                    (*(unsigned char volatile far *)0x7ef9d4)
#define     PDSR                    (*(unsigned char volatile far *)0x7ef9d5)
#define     PESR                    (*(unsigned char volatile far *)0x7ef9d6)
#define     PFSR                    (*(unsigned char volatile far *)0x7ef9d7)

#define     P8DR                    (*(unsigned char volatile far *)0x7ef9d8)
#define     P9DR                    (*(unsigned char volatile far *)0x7ef9d9)
#define     PADR                    (*(unsigned char volatile far *)0x7ef9da)
#define     PBDR                    (*(unsigned char volatile far *)0x7ef9db)
#define     PCDR                    (*(unsigned char volatile far *)0x7ef9dc)
#define     PDDR                    (*(unsigned char volatile far *)0x7ef9dd)
#define     PEDR                    (*(unsigned char volatile far *)0x7ef9de)
#define     PFDR                    (*(unsigned char volatile far *)0x7ef9df)

#define     P8IE                    (*(unsigned char volatile far *)0x7ef9e0)
#define     P9IE                    (*(unsigned char volatile far *)0x7ef9e1)
#define     PAIE                    (*(unsigned char volatile far *)0x7ef9e2)
#define     PBIE                    (*(unsigned char volatile far *)0x7ef9e3)
#define     PCIE                    (*(unsigned char volatile far *)0x7ef9e4)
#define     PDIE                    (*(unsigned char volatile far *)0x7ef9e5)
#define     PEIE                    (*(unsigned char volatile far *)0x7ef9e6)
#define     PFIE                    (*(unsigned char volatile far *)0x7ef9e7)

#define     P8PD                    (*(unsigned char volatile far *)0x7ef9f0)
#define     P9PD                    (*(unsigned char volatile far *)0x7ef9f1)
#define     PAPD                    (*(unsigned char volatile far *)0x7ef9f2)
#define     PBPD                    (*(unsigned char volatile far *)0x7ef9f3)
#define     PCPD                    (*(unsigned char volatile far *)0x7ef9f4)
#define     PDPD                    (*(unsigned char volatile far *)0x7ef9f5)
#define     PEPD                    (*(unsigned char volatile far *)0x7ef9f6)
#define     PFPD                    (*(unsigned char volatile far *)0x7ef9f7)

#define     P8BP                    (*(unsigned char volatile far *)0x7ef9f8)
#define     P9BP                    (*(unsigned char volatile far *)0x7ef9f9)
#define     PABP                    (*(unsigned char volatile far *)0x7ef9fa)
#define     PBBP                    (*(unsigned char volatile far *)0x7ef9fb)
#define     PCBP                    (*(unsigned char volatile far *)0x7ef9fc)
#define     PDBP                    (*(unsigned char volatile far *)0x7ef9fd)
#define     PEBP                    (*(unsigned char volatile far *)0x7ef9fe)
#define     PFBP                    (*(unsigned char volatile far *)0x7ef9ff)

/////////////////////////////////////////////////
//7E:F800H-7E:F8FFH
/////////////////////////////////////////////////

#define     SPI2CTL                 (*(unsigned char volatile far *)0x7ef800)
#define     SPI2STAT                (*(unsigned char volatile far *)0x7ef801)
#define     SPI2DAT                 (*(unsigned char volatile far *)0x7ef802)
#define     SPI2TOTE                (*(unsigned char volatile far *)0x7ef803)
#define     SPI2TOCR                (*(unsigned char volatile far *)0x7ef804)
#define     SPI2TOSR                (*(unsigned char volatile far *)0x7ef805)
#define     SPI2TOTH                (*(unsigned char volatile far *)0x7ef806)
#define     SPI2TOTL                (*(unsigned char volatile far *)0x7ef807)
#define     SPI2_CLKDIV             (*(unsigned char volatile far *)0x7ef808)
#define     HSSPI2_CFG              (*(unsigned char volatile far *)0x7ef809)
#define     HSSPI2_CFG2             (*(unsigned char volatile far *)0x7ef80a)
#define     HSSPI2_STA              (*(unsigned char volatile far *)0x7ef80b)
#define     HSSPI2_PSCR             (*(unsigned char volatile far *)0x7ef80c)

#define     DMA_SPI2_CFG            (*(unsigned char volatile far *)0x7ef810)
#define     DMA_SPI2_CR             (*(unsigned char volatile far *)0x7ef811)
#define     DMA_SPI2_STA            (*(unsigned char volatile far *)0x7ef812)
#define     DMA_SPI2_CFG2           (*(unsigned char volatile far *)0x7ef813)
#define     DMA_SPI2_AMTH           (*(unsigned char volatile far *)0x7ef814)
#define     DMA_SPI2_AMT            (*(unsigned char volatile far *)0x7ef815)
#define     DMA_SPI2_DONEH          (*(unsigned char volatile far *)0x7ef816)
#define     DMA_SPI2_DONE           (*(unsigned char volatile far *)0x7ef817)
#define     DMA_SPI2_TXAH           (*(unsigned char volatile far *)0x7ef818)
#define     DMA_SPI2_TXAL           (*(unsigned char volatile far *)0x7ef819)
#define     DMA_SPI2_RXAH           (*(unsigned char volatile far *)0x7ef81a)
#define     DMA_SPI2_RXAL           (*(unsigned char volatile far *)0x7ef81b)
#define     DMA_SPI2_ITVH           (*(unsigned char volatile far *)0x7ef81e)
#define     DMA_SPI2_ITVL           (*(unsigned char volatile far *)0x7ef81f)

#define     SPI3CTL                 (*(unsigned char volatile far *)0x7ef820)
#define     SPI3STAT                (*(unsigned char volatile far *)0x7ef821)
#define     SPI3DAT                 (*(unsigned char volatile far *)0x7ef822)
#define     SPI3TOTE                (*(unsigned char volatile far *)0x7ef823)
#define     SPI3TOCR                (*(unsigned char volatile far *)0x7ef824)
#define     SPI3TOSR                (*(unsigned char volatile far *)0x7ef825)
#define     SPI3TOTH                (*(unsigned char volatile far *)0x7ef826)
#define     SPI3TOTL                (*(unsigned char volatile far *)0x7ef827)
#define     SPI3_CLKDIV             (*(unsigned char volatile far *)0x7ef828)
#define     HSSPI3_CFG              (*(unsigned char volatile far *)0x7ef829)
#define     HSSPI3_CFG2             (*(unsigned char volatile far *)0x7ef82a)
#define     HSSPI3_STA              (*(unsigned char volatile far *)0x7ef82b)
#define     HSSPI3_PSCR             (*(unsigned char volatile far *)0x7ef82c)

