yunvfeng/smart-car/libraries/zf_common/stc32g144k246.h
#define     DMA_SPI3_CFG            (*(unsigned char volatile far *)0x7ef830)
#define     DMA_SPI3_CR             (*(unsigned char volatile far *)0x7ef831)
#define     DMA_SPI3_STA            (*(unsigned char volatile far *)0x7ef832)
#define     DMA_SPI3_CFG2           (*(unsigned char volatile far *)0x7ef833)
#define     DMA_SPI3_AMTH           (*(unsigned char volatile far *)0x7ef834)
#define     DMA_SPI3_AMT            (*(unsigned char volatile far *)0x7ef835)
#define     DMA_SPI3_DONEH          (*(unsigned char volatile far *)0x7ef836)
#define     DMA_SPI3_DONE           (*(unsigned char volatile far *)0x7ef837)
#define     DMA_SPI3_TXAH           (*(unsigned char volatile far *)0x7ef838)
#define     DMA_SPI3_TXAL           (*(unsigned char volatile far *)0x7ef839)
#define     DMA_SPI3_RXAH           (*(unsigned char volatile far *)0x7ef83a)
#define     DMA_SPI3_RXAL           (*(unsigned char volatile far *)0x7ef83b)
#define     DMA_SPI3_ITVH           (*(unsigned char volatile far *)0x7ef83e)
#define     DMA_SPI3_ITVL           (*(unsigned char volatile far *)0x7ef83f)

#define     I2C2CFG                 (*(unsigned char volatile far *)0x7ef860)
#define     I2C2MSCR                (*(unsigned char volatile far *)0x7ef861)
#define     I2C2MSST                (*(unsigned char volatile far *)0x7ef862)
#define     I2C2SLCR                (*(unsigned char volatile far *)0x7ef863)
#define     I2C2SLST                (*(unsigned char volatile far *)0x7ef864)
#define     I2C2SLADR               (*(unsigned char volatile far *)0x7ef865)
#define     I2C2TXD                 (*(unsigned char volatile far *)0x7ef866)
#define     I2C2RXD                 (*(unsigned char volatile far *)0x7ef867)
#define     I2C2MSAUX               (*(unsigned char volatile far *)0x7ef868)
#define     I2C2PSCR                (*(unsigned char volatile far *)0x7ef869)
#define     I2C2TOTE                (*(unsigned char volatile far *)0x7ef86b)
#define     I2C2TOCR                (*(unsigned char volatile far *)0x7ef86c)
#define     I2C2TOSR                (*(unsigned char volatile far *)0x7ef86d)
#define     I2C2TOTH                (*(unsigned char volatile far *)0x7ef86e)
#define     I2C2TOTL                (*(unsigned char volatile far *)0x7ef86f)

#define     DMA_I2C2T_CFG           (*(unsigned char volatile far *)0x7ef870)
#define     DMA_I2C2T_CR            (*(unsigned char volatile far *)0x7ef871)
#define     DMA_I2C2T_STA           (*(unsigned char volatile far *)0x7ef872)
#define     DMA_I2C2T_AMTH          (*(unsigned char volatile far *)0x7ef874)
#define     DMA_I2C2T_AMT           (*(unsigned char volatile far *)0x7ef875)
#define     DMA_I2C2T_DONEH         (*(unsigned char volatile far *)0x7ef876)
#define     DMA_I2C2T_DONE          (*(unsigned char volatile far *)0x7ef877)
#define     DMA_I2C2T_TXAH          (*(unsigned char volatile far *)0x7ef878)
#define     DMA_I2C2T_TXAL          (*(unsigned char volatile far *)0x7ef879)

#define     DMA_I2C2_CR             (*(unsigned char volatile far *)0x7ef87b)
#define     DMA_I2C2_ST1            (*(unsigned char volatile far *)0x7ef87c)
#define     DMA_I2C2_ST2            (*(unsigned char volatile far *)0x7ef87d)
#define     DMA_I2C2_ITVH           (*(unsigned char volatile far *)0x7ef87e)
#define     DMA_I2C2_ITVL           (*(unsigned char volatile far *)0x7ef87f)

#define     DMA_I2C2R_CFG           (*(unsigned char volatile far *)0x7ef880)
#define     DMA_I2C2R_CR            (*(unsigned char volatile far *)0x7ef881)
#define     DMA_I2C2R_STA           (*(unsigned char volatile far *)0x7ef882)
#define     DMA_I2C2R_AMTH          (*(unsigned char volatile far *)0x7ef884)
#define     DMA_I2C2R_AMT           (*(unsigned char volatile far *)0x7ef885)
#define     DMA_I2C2R_DONEH         (*(unsigned char volatile far *)0x7ef886)
#define     DMA_I2C2R_DONE          (*(unsigned char volatile far *)0x7ef887)
#define     DMA_I2C2R_RXAH          (*(unsigned char volatile far *)0x7ef888)
#define     DMA_I2C2R_RXAL          (*(unsigned char volatile far *)0x7ef889)

#define     DMA_I2S2T_CFG           (*(unsigned char volatile far *)0x7ef890)
#define     DMA_I2S2T_CR            (*(unsigned char volatile far *)0x7ef891)
#define     DMA_I2S2T_STA           (*(unsigned char volatile far *)0x7ef892)
#define     DMA_I2S2T_AMTH          (*(unsigned char volatile far *)0x7ef894)
#define     DMA_I2S2T_AMT           (*(unsigned char volatile far *)0x7ef895)
#define     DMA_I2S2T_DONEH         (*(unsigned char volatile far *)0x7ef896)
#define     DMA_I2S2T_DONE          (*(unsigned char volatile far *)0x7ef897)
#define     DMA_I2S2T_TXAH          (*(unsigned char volatile far *)0x7ef898)
#define     DMA_I2S2T_TXAL          (*(unsigned char volatile far *)0x7ef899)
#define     DMA_I2S2_ITVH           (*(unsigned char volatile far *)0x7ef89e)
#define     DMA_I2S2_ITVL           (*(unsigned char volatile far *)0x7ef89f)

#define     DMA_I2S2R_CFG           (*(unsigned char volatile far *)0x7ef8a0)
#define     DMA_I2S2R_CR            (*(unsigned char volatile far *)0x7ef8a1)
#define     DMA_I2S2R_STA           (*(unsigned char volatile far *)0x7ef8a2)
#define     DMA_I2S2R_AMTH          (*(unsigned char volatile far *)0x7ef8a4)
#define     DMA_I2S2R_AMT           (*(unsigned char volatile far *)0x7ef8a5)
#define     DMA_I2S2R_DONEH         (*(unsigned char volatile far *)0x7ef8a6)
#define     DMA_I2S2R_DONE          (*(unsigned char volatile far *)0x7ef8a7)
#define     DMA_I2S2R_RXAH          (*(unsigned char volatile far *)0x7ef8a8)
#define     DMA_I2S2R_RXAL          (*(unsigned char volatile far *)0x7ef8a9)

#define     PWMC_ETRPS              (*(unsigned char volatile far *)0x7ef8b0)
#define     PWMC_ENO                (*(unsigned char volatile far *)0x7ef8b1)
#define     PWMC_PS                 (*(unsigned char volatile far *)0x7ef8b2)
#define     PWMC_IOAUX              (*(unsigned char volatile far *)0x7ef8b3)
#define     PWMD_ETRPS              (*(unsigned char volatile far *)0x7ef8b4)
#define     PWMD_ENO                (*(unsigned char volatile far *)0x7ef8b5)
#define     PWMD_PS                 (*(unsigned char volatile far *)0x7ef8b6)
#define     PWMD_IOAUX              (*(unsigned char volatile far *)0x7ef8b7)
#define     PWMC_PS2                (*(unsigned char volatile far *)0x7ef8b8)
#define     PWMC_RCRH               (*(unsigned char volatile far *)0x7ef8b9)
#define     PWMD_RCRH               (*(unsigned char volatile far *)0x7ef8ba)

#define     PWMC_CR1                (*(unsigned char volatile far *)0x7ef8c0)
#define     PWMC_CR2                (*(unsigned char volatile far *)0x7ef8c1)
#define     PWMC_SMCR               (*(unsigned char volatile far *)0x7ef8c2)
#define     PWMC_ETR                (*(unsigned char volatile far *)0x7ef8c3)
#define     PWMC_IER                (*(unsigned char volatile far *)0x7ef8c4)
#define     PWMC_SR1                (*(unsigned char volatile far *)0x7ef8c5)
#define     PWMC_SR2                (*(unsigned char volatile far *)0x7ef8c6)
#define     PWMC_EGR                (*(unsigned char volatile far *)0x7ef8c7)
#define     PWMC_CCMR1              (*(unsigned char volatile far *)0x7ef8c8)
#define     PWMC_CCMR2              (*(unsigned char volatile far *)0x7ef8c9)
#define     PWMC_CCMR3              (*(unsigned char volatile far *)0x7ef8ca)
#define     PWMC_CCMR4              (*(unsigned char volatile far *)0x7ef8cb)
#define     PWMC_CCER1              (*(unsigned char volatile far *)0x7ef8cc)
#define     PWMC_CCER2              (*(unsigned char volatile far *)0x7ef8cd)
#define     PWMC_CNTRH              (*(unsigned char volatile far *)0x7ef8ce)
#define     PWMC_CNTRL              (*(unsigned char volatile far *)0x7ef8cf)
#define     PWMC_PSCRH              (*(unsigned char volatile far *)0x7ef8d0)
#define     PWMC_PSCRL              (*(unsigned char volatile far *)0x7ef8d1)
#define     PWMC_ARRH               (*(unsigned char volatile far *)0x7ef8d2)
#define     PWMC_ARRL               (*(unsigned char volatile far *)0x7ef8d3)
#define     PWMC_RCR                (*(unsigned char volatile far *)0x7ef8d4)
#define     PWMC_CCR1H              (*(unsigned char volatile far *)0x7ef8d5)
#define     PWMC_CCR1L              (*(unsigned char volatile far *)0x7ef8d6)
#define     PWMC_CCR2H              (*(unsigned char volatile far *)0x7ef8d7)
#define     PWMC_CCR2L              (*(unsigned char volatile far *)0x7ef8d8)
#define     PWMC_CCR3H              (*(unsigned char volatile far *)0x7ef8d9)
#define     PWMC_CCR3L              (*(unsigned char volatile far *)0x7ef8da)
#define     PWMC_CCR4H              (*(unsigned char volatile far *)0x7ef8db)
#define     PWMC_CCR4L              (*(unsigned char volatile far *)0x7ef8dc)
#define     PWMC_BKR                (*(unsigned char volatile far *)0x7ef8dd)
#define     PWMC_DTR                (*(unsigned char volatile far *)0x7ef8de)
#define     PWMC_OISR               (*(unsigned char volatile far *)0x7ef8df)

#define     PWMD_CR1                (*(unsigned char volatile far *)0x7ef8e0)
#define     PWMD_CR2                (*(unsigned char volatile far *)0x7ef8e1)
#define     PWMD_SMCR               (*(unsigned char volatile far *)0x7ef8e2)
#define     PWMD_ETR                (*(unsigned char volatile far *)0x7ef8e3)
#define     PWMD_IER                (*(unsigned char volatile far *)0x7ef8e4)
#define     PWMD_SR1                (*(unsigned char volatile far *)0x7ef8e5)
#define     PWMD_SR2                (*(unsigned char volatile far *)0x7ef8e6)
#define     PWMD_EGR                (*(unsigned char volatile far *)0x7ef8e7)
#define     PWMD_CCMR1              (*(unsigned char volatile far *)0x7ef8e8)
#define     PWMD_CCMR2              (*(unsigned char volatile far *)0x7ef8e9)
#define     PWMD_CCMR3              (*(unsigned char volatile far *)0x7ef8ea)
#define     PWMD_CCMR4              (*(unsigned char volatile far *)0x7ef8eb)
#define     PWMD_CCER1              (*(unsigned char volatile far *)0x7ef8ec)
#define     PWMD_CCER2              (*(unsigned char volatile far *)0x7ef8ed)
#define     PWMD_CNTRH              (*(unsigned char volatile far *)0x7ef8ee)
#define     PWMD_CNTRL              (*(unsigned char volatile far *)0x7ef8ef)
#define     PWMD_PSCRH              (*(unsigned char volatile far *)0x7ef8f0)
#define     PWMD_PSCRL              (*(unsigned char volatile far *)0x7ef8f1)
#define     PWMD_ARRH               (*(unsigned char volatile far *)0x7ef8f2)
#define     PWMD_ARRL               (*(unsigned char volatile far *)0x7ef8f3)
#define     PWMD_RCR                (*(unsigned char volatile far *)0x7ef8f4)
#define     PWMD_CCR5H              (*(unsigned char volatile far *)0x7ef8f5)
#define     PWMD_CCR5L              (*(unsigned char volatile far *)0x7ef8f6)
#define     PWMD_CCR6H              (*(unsigned char volatile far *)0x7ef8f7)
#define     PWMD_CCR6L              (*(unsigned char volatile far *)0x7ef8f8)
#define     PWMD_CCR7H              (*(unsigned char volatile far *)0x7ef8f9)
#define     PWMD_CCR7L              (*(unsigned char volatile far *)0x7ef8fa)
#define     PWMD_CCR8H              (*(unsigned char volatile far *)0x7ef8fb)
#define     PWMD_CCR8L              (*(unsigned char volatile far *)0x7ef8fc)
#define     PWMD_BKR                (*(unsigned char volatile far *)0x7ef8fd)
#define     PWMD_DTR                (*(unsigned char volatile far *)0x7ef8fe)
#define     PWMD_OISR               (*(unsigned char volatile far *)0x7ef8ff)


/////////////////////////////////////////////////
//7E:F700H-7E:F7FFH
/////////////////////////////////////////////////

#define     P8OUT                   (*(unsigned char volatile far *)0x7ef700)
#define     P9OUT                   (*(unsigned char volatile far *)0x7ef701)
#define     PAOUT                   (*(unsigned char volatile far *)0x7ef702)
#define     PBOUT                   (*(unsigned char volatile far *)0x7ef703)
#define     PCOUT                   (*(unsigned char volatile far *)0x7ef704)
#define     PDOUT                   (*(unsigned char volatile far *)0x7ef705)
#define     PEOUT                   (*(unsigned char volatile far *)0x7ef706)
#define     PFOUT                   (*(unsigned char volatile far *)0x7ef707)

#define     P8IN                    (*(unsigned char volatile far *)0x7ef708)
#define     P9IN                    (*(unsigned char volatile far *)0x7ef709)
#define     PAIN                    (*(unsigned char volatile far *)0x7ef70a)
#define     PBIN                    (*(unsigned char volatile far *)0x7ef70b)
#define     PCIN                    (*(unsigned char volatile far *)0x7ef70c)
#define     PDIN                    (*(unsigned char volatile far *)0x7ef70d)
#define     PEIN                    (*(unsigned char volatile far *)0x7ef70e)
#define     PFIN                    (*(unsigned char volatile far *)0x7ef70f)

#define     P8M0                    (*(unsigned char volatile far *)0x7ef710)
#define     P9M0                    (*(unsigned char volatile far *)0x7ef711)
#define     PAM0                    (*(unsigned char volatile far *)0x7ef712)
#define     PBM0                    (*(unsigned char volatile far *)0x7ef713)
#define     PCM0                    (*(unsigned char volatile far *)0x7ef714)
#define     PDM0                    (*(unsigned char volatile far *)0x7ef715)
#define     PEM0                    (*(unsigned char volatile far *)0x7ef716)
#define     PFM0                    (*(unsigned char volatile far *)0x7ef717)

#define     P8M1                    (*(unsigned char volatile far *)0x7ef718)
#define     P9M1                    (*(unsigned char volatile far *)0x7ef719)
#define     PAM1                    (*(unsigned char volatile far *)0x7ef71a)
#define     PBM1                    (*(unsigned char volatile far *)0x7ef71b)
#define     PCM1                    (*(unsigned char volatile far *)0x7ef71c)
#define     PDM1                    (*(unsigned char volatile far *)0x7ef71d)
#define     PEM1                    (*(unsigned char volatile far *)0x7ef71e)
#define     PFM1                    (*(unsigned char volatile far *)0x7ef71f)

