yunvfeng/smart-car/libraries/zf_common/stc32g144k246.h
#define     P8SETB                  (*(unsigned char volatile far *)0x7ef720)
#define     P9SETB                  (*(unsigned char volatile far *)0x7ef721)
#define     PASETB                  (*(unsigned char volatile far *)0x7ef722)
#define     PBSETB                  (*(unsigned char volatile far *)0x7ef723)
#define     PCSETB                  (*(unsigned char volatile far *)0x7ef724)
#define     PDSETB                  (*(unsigned char volatile far *)0x7ef725)
#define     PESETB                  (*(unsigned char volatile far *)0x7ef726)
#define     PFSETB                  (*(unsigned char volatile far *)0x7ef727)

#define     P8CLRB                  (*(unsigned char volatile far *)0x7ef728)
#define     P9CLRB                  (*(unsigned char volatile far *)0x7ef729)
#define     PACLRB                  (*(unsigned char volatile far *)0x7ef72a)
#define     PBCLRB                  (*(unsigned char volatile far *)0x7ef72b)
#define     PCCLRB                  (*(unsigned char volatile far *)0x7ef72c)
#define     PDCLRB                  (*(unsigned char volatile far *)0x7ef72d)
#define     PECLRB                  (*(unsigned char volatile far *)0x7ef72e)
#define     PFCLRB                  (*(unsigned char volatile far *)0x7ef72f)

#define     S5CON                   (*(unsigned char volatile far *)0x7ef740)
#define     S5BUF                   (*(unsigned char volatile far *)0x7ef741)
#define     S5INTR                  (*(unsigned char volatile far *)0x7ef742)
#define     UR5TOTE                 (*(unsigned char volatile far *)0x7ef743)
#define     UR5TOCR                 (*(unsigned char volatile far *)0x7ef744)
#define     UR5TOSR                 (*(unsigned char volatile far *)0x7ef745)
#define     UR5TOTH                 (*(unsigned char volatile far *)0x7ef746)
#define     UR5TOTL                 (*(unsigned char volatile far *)0x7ef747)

#define     USART5CR1               (*(unsigned char volatile far *)0x7ef748)
#define     USART5CR2               (*(unsigned char volatile far *)0x7ef749)
#define     USART5CR3               (*(unsigned char volatile far *)0x7ef74a)
#define     USART5CR4               (*(unsigned char volatile far *)0x7ef74b)
#define     USART5CR5               (*(unsigned char volatile far *)0x7ef74c)
#define     USART5GTR               (*(unsigned char volatile far *)0x7ef74d)
#define     USART5BR1               (*(unsigned char volatile far *)0x7ef74e)
#define     USART5BR2               (*(unsigned char volatile far *)0x7ef74f)

#define     DMA_UR5T_CFG            (*(unsigned char volatile far *)0x7ef750)
#define     DMA_UR5T_CR             (*(unsigned char volatile far *)0x7ef751)
#define     DMA_UR5T_STA            (*(unsigned char volatile far *)0x7ef752)
#define     DMA_UR5T_AMTH           (*(unsigned char volatile far *)0x7ef754)
#define     DMA_UR5T_AMT            (*(unsigned char volatile far *)0x7ef755)
#define     DMA_UR5T_DONEH          (*(unsigned char volatile far *)0x7ef756)
#define     DMA_UR5T_DONE           (*(unsigned char volatile far *)0x7ef757)
#define     DMA_UR5T_TXAH           (*(unsigned char volatile far *)0x7ef758)
#define     DMA_UR5T_TXAL           (*(unsigned char volatile far *)0x7ef759)
#define     DMA_UR5_ITVH            (*(unsigned char volatile far *)0x7ef75e)
#define     DMA_UR5_ITVL            (*(unsigned char volatile far *)0x7ef75f)

#define     DMA_UR5R_CFG            (*(unsigned char volatile far *)0x7ef760)
#define     DMA_UR5R_CR             (*(unsigned char volatile far *)0x7ef761)
#define     DMA_UR5R_STA            (*(unsigned char volatile far *)0x7ef762)
#define     DMA_UR5R_AMTH           (*(unsigned char volatile far *)0x7ef764)
#define     DMA_UR5R_AMT            (*(unsigned char volatile far *)0x7ef765)
#define     DMA_UR5R_DONEH          (*(unsigned char volatile far *)0x7ef766)
#define     DMA_UR5R_DONE           (*(unsigned char volatile far *)0x7ef767)
#define     DMA_UR5R_RXAH           (*(unsigned char volatile far *)0x7ef768)
#define     DMA_UR5R_RXAL           (*(unsigned char volatile far *)0x7ef769)

#define     S5CFG                   (*(unsigned char volatile far *)0x7ef76d)
#define     S5ADDR                  (*(unsigned char volatile far *)0x7ef76e)
#define     S5ADEN                  (*(unsigned char volatile far *)0x7ef76f)

#define     S6CON                   (*(unsigned char volatile far *)0x7ef770)
#define     S6BUF                   (*(unsigned char volatile far *)0x7ef771)
#define     S6INTR                  (*(unsigned char volatile far *)0x7ef772)
#define     UR6TOTE                 (*(unsigned char volatile far *)0x7ef773)
#define     UR6TOCR                 (*(unsigned char volatile far *)0x7ef774)
#define     UR6TOSR                 (*(unsigned char volatile far *)0x7ef775)
#define     UR6TOTH                 (*(unsigned char volatile far *)0x7ef776)
#define     UR6TOTL                 (*(unsigned char volatile far *)0x7ef777)

#define     USART6CR1               (*(unsigned char volatile far *)0x7ef778)
#define     USART6CR2               (*(unsigned char volatile far *)0x7ef779)
#define     USART6CR3               (*(unsigned char volatile far *)0x7ef77a)
#define     USART6CR4               (*(unsigned char volatile far *)0x7ef77b)
#define     USART6CR5               (*(unsigned char volatile far *)0x7ef77c)
#define     USART6GTR               (*(unsigned char volatile far *)0x7ef77d)
#define     USART6BR1               (*(unsigned char volatile far *)0x7ef77e)
#define     USART6BR2               (*(unsigned char volatile far *)0x7ef77f)

#define     DMA_UR6T_CFG            (*(unsigned char volatile far *)0x7ef780)
#define     DMA_UR6T_CR             (*(unsigned char volatile far *)0x7ef781)
#define     DMA_UR6T_STA            (*(unsigned char volatile far *)0x7ef782)
#define     DMA_UR6T_AMTH           (*(unsigned char volatile far *)0x7ef784)
#define     DMA_UR6T_AMT            (*(unsigned char volatile far *)0x7ef785)
#define     DMA_UR6T_DONEH          (*(unsigned char volatile far *)0x7ef786)
#define     DMA_UR6T_DONE           (*(unsigned char volatile far *)0x7ef787)
#define     DMA_UR6T_TXAH           (*(unsigned char volatile far *)0x7ef788)
#define     DMA_UR6T_TXAL           (*(unsigned char volatile far *)0x7ef789)
#define     DMA_UR6_ITVH            (*(unsigned char volatile far *)0x7ef78e)
#define     DMA_UR6_ITVL            (*(unsigned char volatile far *)0x7ef78f)

#define     DMA_UR6R_CFG            (*(unsigned char volatile far *)0x7ef790)
#define     DMA_UR6R_CR             (*(unsigned char volatile far *)0x7ef791)
#define     DMA_UR6R_STA            (*(unsigned char volatile far *)0x7ef792)
#define     DMA_UR6R_AMTH           (*(unsigned char volatile far *)0x7ef794)
#define     DMA_UR6R_AMT            (*(unsigned char volatile far *)0x7ef795)
#define     DMA_UR6R_DONEH          (*(unsigned char volatile far *)0x7ef796)
#define     DMA_UR6R_DONE           (*(unsigned char volatile far *)0x7ef797)
#define     DMA_UR6R_RXAH           (*(unsigned char volatile far *)0x7ef798)
#define     DMA_UR6R_RXAL           (*(unsigned char volatile far *)0x7ef799)

#define     S6CFG                   (*(unsigned char volatile far *)0x7ef79d)
#define     S6ADDR                  (*(unsigned char volatile far *)0x7ef79e)
#define     S6ADEN                  (*(unsigned char volatile far *)0x7ef79f)

#define     S7CON                   (*(unsigned char volatile far *)0x7ef7a0)
#define     S7BUF                   (*(unsigned char volatile far *)0x7ef7a1)
#define     S7INTR                  (*(unsigned char volatile far *)0x7ef7a2)
#define     UR7TOTE                 (*(unsigned char volatile far *)0x7ef7a3)
#define     UR7TOCR                 (*(unsigned char volatile far *)0x7ef7a4)
#define     UR7TOSR                 (*(unsigned char volatile far *)0x7ef7a5)
#define     UR7TOTH                 (*(unsigned char volatile far *)0x7ef7a6)
#define     UR7TOTL                 (*(unsigned char volatile far *)0x7ef7a7)

#define     USART7CR1               (*(unsigned char volatile far *)0x7ef7a8)
#define     USART7CR2               (*(unsigned char volatile far *)0x7ef7a9)
#define     USART7CR3               (*(unsigned char volatile far *)0x7ef7aa)
#define     USART7CR4               (*(unsigned char volatile far *)0x7ef7ab)
#define     USART7CR5               (*(unsigned char volatile far *)0x7ef7ac)
#define     USART7GTR               (*(unsigned char volatile far *)0x7ef7ad)
#define     USART7BR1               (*(unsigned char volatile far *)0x7ef7ae)
#define     USART7BR2               (*(unsigned char volatile far *)0x7ef7af)

#define     DMA_UR7T_CFG            (*(unsigned char volatile far *)0x7ef7b0)
#define     DMA_UR7T_CR             (*(unsigned char volatile far *)0x7ef7b1)
#define     DMA_UR7T_STA            (*(unsigned char volatile far *)0x7ef7b2)
#define     DMA_UR7T_AMTH           (*(unsigned char volatile far *)0x7ef7b4)
#define     DMA_UR7T_AMT            (*(unsigned char volatile far *)0x7ef7b5)
#define     DMA_UR7T_DONEH          (*(unsigned char volatile far *)0x7ef7b6)
#define     DMA_UR7T_DONE           (*(unsigned char volatile far *)0x7ef7b7)
#define     DMA_UR7T_TXAH           (*(unsigned char volatile far *)0x7ef7b8)
#define     DMA_UR7T_TXAL           (*(unsigned char volatile far *)0x7ef7b9)
#define     DMA_UR7_ITVH            (*(unsigned char volatile far *)0x7ef7be)
#define     DMA_UR7_ITVL            (*(unsigned char volatile far *)0x7ef7bf)

#define     DMA_UR7R_CFG            (*(unsigned char volatile far *)0x7ef7c0)
#define     DMA_UR7R_CR             (*(unsigned char volatile far *)0x7ef7c1)
#define     DMA_UR7R_STA            (*(unsigned char volatile far *)0x7ef7c2)
#define     DMA_UR7R_AMTH           (*(unsigned char volatile far *)0x7ef7c4)
#define     DMA_UR7R_AMT            (*(unsigned char volatile far *)0x7ef7c5)
#define     DMA_UR7R_DONEH          (*(unsigned char volatile far *)0x7ef7c6)
#define     DMA_UR7R_DONE           (*(unsigned char volatile far *)0x7ef7c7)
#define     DMA_UR7R_RXAH           (*(unsigned char volatile far *)0x7ef7c8)
#define     DMA_UR7R_RXAL           (*(unsigned char volatile far *)0x7ef7c9)

#define     S7CFG                   (*(unsigned char volatile far *)0x7ef7cd)
#define     S7ADDR                  (*(unsigned char volatile far *)0x7ef7ce)
#define     S7ADEN                  (*(unsigned char volatile far *)0x7ef7cf)

#define     S8CON                   (*(unsigned char volatile far *)0x7ef7d0)
#define     S8BUF                   (*(unsigned char volatile far *)0x7ef7d1)
#define     S8INTR                  (*(unsigned char volatile far *)0x7ef7d2)
#define     UR8TOTE                 (*(unsigned char volatile far *)0x7ef7d3)
#define     UR8TOCR                 (*(unsigned char volatile far *)0x7ef7d4)
#define     UR8TOSR                 (*(unsigned char volatile far *)0x7ef7d5)
#define     UR8TOTH                 (*(unsigned char volatile far *)0x7ef7d6)
#define     UR8TOTL                 (*(unsigned char volatile far *)0x7ef7d7)

#define     USART8CR1               (*(unsigned char volatile far *)0x7ef7d8)
#define     USART8CR2               (*(unsigned char volatile far *)0x7ef7d9)
#define     USART8CR3               (*(unsigned char volatile far *)0x7ef7da)
#define     USART8CR4               (*(unsigned char volatile far *)0x7ef7db)
#define     USART8CR5               (*(unsigned char volatile far *)0x7ef7dc)
#define     USART8GTR               (*(unsigned char volatile far *)0x7ef7dd)
#define     USART8BR1               (*(unsigned char volatile far *)0x7ef7de)
#define     USART8BR2               (*(unsigned char volatile far *)0x7ef7df)

#define     DMA_UR8T_CFG            (*(unsigned char volatile far *)0x7ef7e0)
#define     DMA_UR8T_CR             (*(unsigned char volatile far *)0x7ef7e1)
#define     DMA_UR8T_STA            (*(unsigned char volatile far *)0x7ef7e2)
#define     DMA_UR8T_AMTH           (*(unsigned char volatile far *)0x7ef7e4)
#define     DMA_UR8T_AMT            (*(unsigned char volatile far *)0x7ef7e5)
#define     DMA_UR8T_DONEH          (*(unsigned char volatile far *)0x7ef7e6)
#define     DMA_UR8T_DONE           (*(unsigned char volatile far *)0x7ef7e7)
#define     DMA_UR8T_TXAH           (*(unsigned char volatile far *)0x7ef7e8)
#define     DMA_UR8T_TXAL           (*(unsigned char volatile far *)0x7ef7e9)
#define     DMA_UR8_ITVH            (*(unsigned char volatile far *)0x7ef7ee)
#define     DMA_UR8_ITVL            (*(unsigned char volatile far *)0x7ef7ef)

#define     DMA_UR8R_CFG            (*(unsigned char volatile far *)0x7ef7f0)
#define     DMA_UR8R_CR             (*(unsigned char volatile far *)0x7ef7f1)
#define     DMA_UR8R_STA            (*(unsigned char volatile far *)0x7ef7f2)
#define     DMA_UR8R_AMTH           (*(unsigned char volatile far *)0x7ef7f4)
#define     DMA_UR8R_AMT            (*(unsigned char volatile far *)0x7ef7f5)
#define     DMA_UR8R_DONEH          (*(unsigned char volatile far *)0x7ef7f6)
#define     DMA_UR8R_DONE           (*(unsigned char volatile far *)0x7ef7f7)
#define     DMA_UR8R_RXAH           (*(unsigned char volatile far *)0x7ef7f8)
#define     DMA_UR8R_RXAL           (*(unsigned char volatile far *)0x7ef7f9)

#define     S8CFG                   (*(unsigned char volatile far *)0x7ef7fd)
#define     S8ADDR                  (*(unsigned char volatile far *)0x7ef7fe)
#define     S8ADEN                  (*(unsigned char volatile far *)0x7ef7ff)

/////////////////////////////////////////////////
//7E:F600H-7E:F6FFH
/////////////////////////////////////////////////

#define     PGA1_CR1                (*(unsigned char volatile far *)0x7ef600)
#define     PGA1_CR2                (*(unsigned char volatile far *)0x7ef601)
#define     PGA2_CR1                (*(unsigned char volatile far *)0x7ef604)
#define     PGA2_CR2                (*(unsigned char volatile far *)0x7ef605)
#define     PGA3_CR1                (*(unsigned char volatile far *)0x7ef608)
#define     PGA3_CR2                (*(unsigned char volatile far *)0x7ef609)
#define     PGA4_CR1                (*(unsigned char volatile far *)0x7ef60c)
#define     PGA4_CR2                (*(unsigned char volatile far *)0x7ef60d)

#define     DAC1_CR                 (*(unsigned char volatile far *)0x7ef610)
#define     DAC1_STA                (*(unsigned char volatile far *)0x7ef611)
#define     DAC1_DATH               (*(unsigned char volatile far *)0x7ef612)
#define     DAC1_DATL               (*(unsigned char volatile far *)0x7ef613)
#define     DAC1_DIVH               (*(unsigned char volatile far *)0x7ef614)
#define     DAC1_DIVL               (*(unsigned char volatile far *)0x7ef615)

#define     DMA_DAC1_CFG            (*(unsigned char volatile far *)0x7ef618)
#define     DMA_DAC1_CR             (*(unsigned char volatile far *)0x7ef619)
#define     DMA_DAC1_STA            (*(unsigned char volatile far *)0x7ef61a)
#define     DMA_DAC1_AMTH           (*(unsigned char volatile far *)0x7ef61c)
#define     DMA_DAC1_AMT            (*(unsigned char volatile far *)0x7ef61d)
#define     DMA_DAC1_DONEH          (*(unsigned char volatile far *)0x7ef61e)
#define     DMA_DAC1_DONE           (*(unsigned char volatile far *)0x7ef61f)
#define     DMA_DAC1_TXAH           (*(unsigned char volatile far *)0x7ef620)
#define     DMA_DAC1_TXAL           (*(unsigned char volatile far *)0x7ef621)
#define     DMA_DAC1_CR1            (*(unsigned char volatile far *)0x7ef623)
#define     DMA_DAC1_ITVH           (*(unsigned char volatile far *)0x7ef626)
#define     DMA_DAC1_ITVL           (*(unsigned char volatile far *)0x7ef627)

#define     DAC2_CR                 (*(unsigned char volatile far *)0x7ef628)
#define     DAC2_STA                (*(unsigned char volatile far *)0x7ef629)
#define     DAC2_DATH               (*(unsigned char volatile far *)0x7ef62a)
#define     DAC2_DATL               (*(unsigned char volatile far *)0x7ef62b)
#define     DAC2_DIVH               (*(unsigned char volatile far *)0x7ef62c)
#define     DAC2_DIVL               (*(unsigned char volatile far *)0x7ef62d)

