yunvfeng/smart-car/libraries/zf_common/stc32g144k246.h
#define     DMA_DAC2_CFG            (*(unsigned char volatile far *)0x7ef630)
#define     DMA_DAC2_CR             (*(unsigned char volatile far *)0x7ef631)
#define     DMA_DAC2_STA            (*(unsigned char volatile far *)0x7ef632)
#define     DMA_DAC2_AMTH           (*(unsigned char volatile far *)0x7ef634)
#define     DMA_DAC2_AMT            (*(unsigned char volatile far *)0x7ef635)
#define     DMA_DAC2_DONEH          (*(unsigned char volatile far *)0x7ef636)
#define     DMA_DAC2_DONE           (*(unsigned char volatile far *)0x7ef637)
#define     DMA_DAC2_TXAH           (*(unsigned char volatile far *)0x7ef638)
#define     DMA_DAC2_TXAL           (*(unsigned char volatile far *)0x7ef639)
#define     DMA_DAC2_CR1            (*(unsigned char volatile far *)0x7ef63b)
#define     DMA_DAC2_ITVH           (*(unsigned char volatile far *)0x7ef63e)
#define     DMA_DAC2_ITVL           (*(unsigned char volatile far *)0x7ef63f)

#define     DMA_PWMET_CFG           (*(unsigned char volatile far *)0x7ef668)
#define     DMA_PWMET_CR            (*(unsigned char volatile far *)0x7ef669)
#define     DMA_PWMET_STA           (*(unsigned char volatile far *)0x7ef66a)
#define     DMA_PWMET_AMTH          (*(unsigned char volatile far *)0x7ef66c)
#define     DMA_PWMET_AMT           (*(unsigned char volatile far *)0x7ef66d)
#define     DMA_PWMET_DONEH         (*(unsigned char volatile far *)0x7ef66e)
#define     DMA_PWMET_DONE          (*(unsigned char volatile far *)0x7ef66f)
#define     DMA_PWMET_TXAH          (*(unsigned char volatile far *)0x7ef670)
#define     DMA_PWMET_TXAL          (*(unsigned char volatile far *)0x7ef671)
#define     DMA_PWME_ITVH           (*(unsigned char volatile far *)0x7ef676)
#define     DMA_PWME_ITVL           (*(unsigned char volatile far *)0x7ef677)

#define     DMA_PWMER_CFG           (*(unsigned char volatile far *)0x7ef678)
#define     DMA_PWMER_CR            (*(unsigned char volatile far *)0x7ef679)
#define     DMA_PWMER_STA           (*(unsigned char volatile far *)0x7ef67a)
#define     DMA_PWMER_AMTH          (*(unsigned char volatile far *)0x7ef67c)
#define     DMA_PWMER_AMT           (*(unsigned char volatile far *)0x7ef67d)
#define     DMA_PWMER_DONEH         (*(unsigned char volatile far *)0x7ef67e)
#define     DMA_PWMER_DONE          (*(unsigned char volatile far *)0x7ef67f)
#define     DMA_PWMER_RXAH          (*(unsigned char volatile far *)0x7ef680)
#define     DMA_PWMER_RXAL          (*(unsigned char volatile far *)0x7ef681)

#define     HSPWME_CFG              (*(unsigned char volatile far *)0x7ef688)
#define     HSPWME_ADR              (*(unsigned char volatile far *)0x7ef689)
#define     HSPWME_DAT              (*(unsigned char volatile far *)0x7ef68a)
#define     PWME_CLKDIV             (*(unsigned char volatile far *)0x7ef68b)
#define     HSPWMF_CFG              (*(unsigned char volatile far *)0x7ef68c)
#define     HSPWMF_ADR              (*(unsigned char volatile far *)0x7ef68d)
#define     HSPWMF_DAT              (*(unsigned char volatile far *)0x7ef68e)
#define     PWMF_CLKDIV             (*(unsigned char volatile far *)0x7ef68f)

#define     PWME_ENO2               (*(unsigned char volatile far *)0x7ef690)
#define     PWME_IOAUX2             (*(unsigned char volatile far *)0x7ef691)
#define     PWME_CR3                (*(unsigned char volatile far *)0x7ef692)
#define     PWME_SR3                (*(unsigned char volatile far *)0x7ef693)
#define     PWME_CCER3              (*(unsigned char volatile far *)0x7ef694)
#define     PWME_CCMR1X             (*(unsigned char volatile far *)0x7ef698)
#define     PWME_CCMR2X             (*(unsigned char volatile far *)0x7ef699)
#define     PWME_CCMR3X             (*(unsigned char volatile far *)0x7ef69a)
#define     PWME_CCMR4X             (*(unsigned char volatile far *)0x7ef69b)
#define     PWME_CCMR5              (*(unsigned char volatile far *)0x7ef69c)
#define     PWME_CCMR5X             (*(unsigned char volatile far *)0x7ef69d)
#define     PWME_CCMR6              (*(unsigned char volatile far *)0x7ef69e)
#define     PWME_CCMR6X             (*(unsigned char volatile far *)0x7ef69f)
#define     PWME_CCR5H              (*(unsigned char volatile far *)0x7ef6a0)
#define     PWME_CCR5L              (*(unsigned char volatile far *)0x7ef6a1)
#define     PWME_CCR5X              (*(unsigned char volatile far *)0x7ef6a2)
#define     PWME_CCR6H              (*(unsigned char volatile far *)0x7ef6a3)
#define     PWME_CCR6L              (*(unsigned char volatile far *)0x7ef6a4)
#define     PWME_DER                (*(unsigned char volatile far *)0x7ef6a8)
#define     PWME_DBA                (*(unsigned char volatile far *)0x7ef6a9)
#define     PWME_DBL                (*(unsigned char volatile far *)0x7ef6aa)
#define     PWME_DMACR              (*(unsigned char volatile far *)0x7ef6ab)

#define     PWME_ETRPS              (*(unsigned char volatile far *)0x7ef6b0)
#define     PWME_ENO                (*(unsigned char volatile far *)0x7ef6b1)
#define     PWME_PS                 (*(unsigned char volatile far *)0x7ef6b2)
#define     PWME_IOAUX              (*(unsigned char volatile far *)0x7ef6b3)
#define     PWMF_ETRPS              (*(unsigned char volatile far *)0x7ef6b4)
#define     PWMF_ENO                (*(unsigned char volatile far *)0x7ef6b5)
#define     PWMF_PS                 (*(unsigned char volatile far *)0x7ef6b6)
#define     PWMF_IOAUX              (*(unsigned char volatile far *)0x7ef6b7)
#define     PWME_PS2                (*(unsigned char volatile far *)0x7ef6b8)
#define     PWME_RCRH               (*(unsigned char volatile far *)0x7ef6b9)
#define     PWMF_RCRH               (*(unsigned char volatile far *)0x7ef6ba)

#define     PWME_CR1                (*(unsigned char volatile far *)0x7ef6c0)
#define     PWME_CR2                (*(unsigned char volatile far *)0x7ef6c1)
#define     PWME_SMCR               (*(unsigned char volatile far *)0x7ef6c2)
#define     PWME_ETR                (*(unsigned char volatile far *)0x7ef6c3)
#define     PWME_IER                (*(unsigned char volatile far *)0x7ef6c4)
#define     PWME_SR1                (*(unsigned char volatile far *)0x7ef6c5)
#define     PWME_SR2                (*(unsigned char volatile far *)0x7ef6c6)
#define     PWME_EGR                (*(unsigned char volatile far *)0x7ef6c7)
#define     PWME_CCMR1              (*(unsigned char volatile far *)0x7ef6c8)
#define     PWME_CCMR2              (*(unsigned char volatile far *)0x7ef6c9)
#define     PWME_CCMR3              (*(unsigned char volatile far *)0x7ef6ca)
#define     PWME_CCMR4              (*(unsigned char volatile far *)0x7ef6cb)
#define     PWME_CCER1              (*(unsigned char volatile far *)0x7ef6cc)
#define     PWME_CCER2              (*(unsigned char volatile far *)0x7ef6cd)
#define     PWME_CNTRH              (*(unsigned char volatile far *)0x7ef6ce)
#define     PWME_CNTRL              (*(unsigned char volatile far *)0x7ef6cf)
#define     PWME_PSCRH              (*(unsigned char volatile far *)0x7ef6d0)
#define     PWME_PSCRL              (*(unsigned char volatile far *)0x7ef6d1)
#define     PWME_ARRH               (*(unsigned char volatile far *)0x7ef6d2)
#define     PWME_ARRL               (*(unsigned char volatile far *)0x7ef6d3)
#define     PWME_RCR                (*(unsigned char volatile far *)0x7ef6d4)
#define     PWME_CCR1H              (*(unsigned char volatile far *)0x7ef6d5)
#define     PWME_CCR1L              (*(unsigned char volatile far *)0x7ef6d6)
#define     PWME_CCR2H              (*(unsigned char volatile far *)0x7ef6d7)
#define     PWME_CCR2L              (*(unsigned char volatile far *)0x7ef6d8)
#define     PWME_CCR3H              (*(unsigned char volatile far *)0x7ef6d9)
#define     PWME_CCR3L              (*(unsigned char volatile far *)0x7ef6da)
#define     PWME_CCR4H              (*(unsigned char volatile far *)0x7ef6db)
#define     PWME_CCR4L              (*(unsigned char volatile far *)0x7ef6dc)
#define     PWME_BKR                (*(unsigned char volatile far *)0x7ef6dd)
#define     PWME_DTR                (*(unsigned char volatile far *)0x7ef6de)
#define     PWME_OISR               (*(unsigned char volatile far *)0x7ef6df)

#define     PWMF_CR1                (*(unsigned char volatile far *)0x7ef6e0)
#define     PWMF_CR2                (*(unsigned char volatile far *)0x7ef6e1)
#define     PWMF_SMCR               (*(unsigned char volatile far *)0x7ef6e2)
#define     PWMF_ETR                (*(unsigned char volatile far *)0x7ef6e3)
#define     PWMF_IER                (*(unsigned char volatile far *)0x7ef6e4)
#define     PWMF_SR1                (*(unsigned char volatile far *)0x7ef6e5)
#define     PWMF_SR2                (*(unsigned char volatile far *)0x7ef6e6)
#define     PWMF_EGR                (*(unsigned char volatile far *)0x7ef6e7)
#define     PWMF_CCMR1              (*(unsigned char volatile far *)0x7ef6e8)
#define     PWMF_CCMR2              (*(unsigned char volatile far *)0x7ef6e9)
#define     PWMF_CCMR3              (*(unsigned char volatile far *)0x7ef6ea)
#define     PWMF_CCMR4              (*(unsigned char volatile far *)0x7ef6eb)
#define     PWMF_CCER1              (*(unsigned char volatile far *)0x7ef6ec)
#define     PWMF_CCER2              (*(unsigned char volatile far *)0x7ef6ed)
#define     PWMF_CNTRH              (*(unsigned char volatile far *)0x7ef6ee)
#define     PWMF_CNTRL              (*(unsigned char volatile far *)0x7ef6ef)
#define     PWMF_PSCRH              (*(unsigned char volatile far *)0x7ef6f0)
#define     PWMF_PSCRL              (*(unsigned char volatile far *)0x7ef6f1)
#define     PWMF_ARRH               (*(unsigned char volatile far *)0x7ef6f2)
#define     PWMF_ARRL               (*(unsigned char volatile far *)0x7ef6f3)
#define     PWMF_RCR                (*(unsigned char volatile far *)0x7ef6f4)
#define     PWMF_CCR5H              (*(unsigned char volatile far *)0x7ef6f5)
#define     PWMF_CCR5L              (*(unsigned char volatile far *)0x7ef6f6)
#define     PWMF_CCR6H              (*(unsigned char volatile far *)0x7ef6f7)
#define     PWMF_CCR6L              (*(unsigned char volatile far *)0x7ef6f8)
#define     PWMF_CCR7H              (*(unsigned char volatile far *)0x7ef6f9)
#define     PWMF_CCR7L              (*(unsigned char volatile far *)0x7ef6fa)
#define     PWMF_CCR8H              (*(unsigned char volatile far *)0x7ef6fb)
#define     PWMF_CCR8L              (*(unsigned char volatile far *)0x7ef6fc)
#define     PWMF_BKR                (*(unsigned char volatile far *)0x7ef6fd)
#define     PWMF_DTR                (*(unsigned char volatile far *)0x7ef6fe)
#define     PWMF_OISR               (*(unsigned char volatile far *)0x7ef6ff)

/////////////////////////////////////////////////
//7E:F500H-7E:F5FFH
/////////////////////////////////////////////////

#define     P0OS                    (*(unsigned char volatile far *)0x7ef500)
#define     P1OS                    (*(unsigned char volatile far *)0x7ef501)
#define     P2OS                    (*(unsigned char volatile far *)0x7ef502)
#define     P3OS                    (*(unsigned char volatile far *)0x7ef503)
#define     P4OS                    (*(unsigned char volatile far *)0x7ef504)
#define     P5OS                    (*(unsigned char volatile far *)0x7ef505)
#define     P6OS                    (*(unsigned char volatile far *)0x7ef506)
#define     P7OS                    (*(unsigned char volatile far *)0x7ef507)
#define     P8OS                    (*(unsigned char volatile far *)0x7ef508)
#define     P9OS                    (*(unsigned char volatile far *)0x7ef509)
#define     PAOS                    (*(unsigned char volatile far *)0x7ef50a)
#define     PBOS                    (*(unsigned char volatile far *)0x7ef50b)
#define     PCOS                    (*(unsigned char volatile far *)0x7ef50c)
#define     PDOS                    (*(unsigned char volatile far *)0x7ef50d)
#define     PEOS                    (*(unsigned char volatile far *)0x7ef50e)
#define     PFOS                    (*(unsigned char volatile far *)0x7ef50f)

#define     P0OD                    (*(unsigned char volatile far *)0x7ef510)
#define     P1OD                    (*(unsigned char volatile far *)0x7ef511)
#define     P2OD                    (*(unsigned char volatile far *)0x7ef512)
#define     P3OD                    (*(unsigned char volatile far *)0x7ef513)
#define     P4OD                    (*(unsigned char volatile far *)0x7ef514)
#define     P5OD                    (*(unsigned char volatile far *)0x7ef515)
#define     P6OD                    (*(unsigned char volatile far *)0x7ef516)
#define     P7OD                    (*(unsigned char volatile far *)0x7ef517)
#define     P8OD                    (*(unsigned char volatile far *)0x7ef518)
#define     P9OD                    (*(unsigned char volatile far *)0x7ef519)
#define     PAOD                    (*(unsigned char volatile far *)0x7ef51a)
#define     PBOD                    (*(unsigned char volatile far *)0x7ef51b)
#define     PCOD                    (*(unsigned char volatile far *)0x7ef51c)
#define     PDOD                    (*(unsigned char volatile far *)0x7ef51d)
#define     PEOD                    (*(unsigned char volatile far *)0x7ef51e)
#define     PFOD                    (*(unsigned char volatile far *)0x7ef51f)

#define     DMA_CAN1T_CFG           (*(unsigned char volatile far *)0x7ef520)
#define     DMA_CAN1T_CR            (*(unsigned char volatile far *)0x7ef521)
#define     DMA_CAN1T_STA           (*(unsigned char volatile far *)0x7ef522)
#define     DMA_CAN1T_AMTH          (*(unsigned char volatile far *)0x7ef524)
#define     DMA_CAN1T_AMT           (*(unsigned char volatile far *)0x7ef525)
#define     DMA_CAN1T_DONEH         (*(unsigned char volatile far *)0x7ef526)
#define     DMA_CAN1T_DONE          (*(unsigned char volatile far *)0x7ef527)
#define     DMA_CAN1T_TXAH          (*(unsigned char volatile far *)0x7ef528)
#define     DMA_CAN1T_TXAL          (*(unsigned char volatile far *)0x7ef529)
#define     DMA_CAN1T_FRM           (*(unsigned char volatile far *)0x7ef52b)
#define     DMA_CAN1T_FCNTH         (*(unsigned char volatile far *)0x7ef52c)
#define     DMA_CAN1T_FCNTL         (*(unsigned char volatile far *)0x7ef52d)
#define     DMA_CAN1_ITVH           (*(unsigned char volatile far *)0x7ef52e)
#define     DMA_CAN1_ITVL           (*(unsigned char volatile far *)0x7ef52f)

#define     DMA_CAN1R_CFG           (*(unsigned char volatile far *)0x7ef530)
#define     DMA_CAN1R_CR            (*(unsigned char volatile far *)0x7ef531)
#define     DMA_CAN1R_STA           (*(unsigned char volatile far *)0x7ef532)
#define     CAN1_AUX_CR             (*(unsigned char volatile far *)0x7ef533)
#define     DMA_CAN1R_AMTH          (*(unsigned char volatile far *)0x7ef534)
#define     DMA_CAN1R_AMT           (*(unsigned char volatile far *)0x7ef535)
#define     DMA_CAN1R_DONEH         (*(unsigned char volatile far *)0x7ef536)
#define     DMA_CAN1R_DONE          (*(unsigned char volatile far *)0x7ef537)
#define     DMA_CAN1R_RXAH          (*(unsigned char volatile far *)0x7ef538)
#define     DMA_CAN1R_RXAL          (*(unsigned char volatile far *)0x7ef539)
#define     DMA_CAN1R_FRM           (*(unsigned char volatile far *)0x7ef53b)
#define     DMA_CAN1R_FCNTH         (*(unsigned char volatile far *)0x7ef53c)
#define     DMA_CAN1R_FCNTL         (*(unsigned char volatile far *)0x7ef53d)

#define     DMA_CAN2T_CFG           (*(unsigned char volatile far *)0x7ef540)
#define     DMA_CAN2T_CR            (*(unsigned char volatile far *)0x7ef541)
#define     DMA_CAN2T_STA           (*(unsigned char volatile far *)0x7ef542)
#define     DMA_CAN2T_AMTH          (*(unsigned char volatile far *)0x7ef544)
#define     DMA_CAN2T_AMT           (*(unsigned char volatile far *)0x7ef545)
#define     DMA_CAN2T_DONEH         (*(unsigned char volatile far *)0x7ef546)
#define     DMA_CAN2T_DONE          (*(unsigned char volatile far *)0x7ef547)
#define     DMA_CAN2T_TXAH          (*(unsigned char volatile far *)0x7ef548)
#define     DMA_CAN2T_TXAL          (*(unsigned char volatile far *)0x7ef549)
#define     DMA_CAN2T_FRM           (*(unsigned char volatile far *)0x7ef54b)
#define     DMA_CAN2T_FCNTH         (*(unsigned char volatile far *)0x7ef54c)
#define     DMA_CAN2T_FCNTL         (*(unsigned char volatile far *)0x7ef54d)
#define     DMA_CAN2_ITVH           (*(unsigned char volatile far *)0x7ef54e)
#define     DMA_CAN2_ITVL           (*(unsigned char volatile far *)0x7ef54f)

#define     DMA_CAN2R_CFG           (*(unsigned char volatile far *)0x7ef550)
#define     DMA_CAN2R_CR            (*(unsigned char volatile far *)0x7ef551)
#define     CAN2_AUX_CR             (*(unsigned char volatile far *)0x7ef553)
#define     DMA_CAN2R_STA           (*(unsigned char volatile far *)0x7ef552)
#define     DMA_CAN2R_AMTH          (*(unsigned char volatile far *)0x7ef554)
#define     DMA_CAN2R_AMT           (*(unsigned char volatile far *)0x7ef555)
#define     DMA_CAN2R_DONEH         (*(unsigned char volatile far *)0x7ef556)
#define     DMA_CAN2R_DONE          (*(unsigned char volatile far *)0x7ef557)
#define     DMA_CAN2R_RXAH          (*(unsigned char volatile far *)0x7ef558)
#define     DMA_CAN2R_RXAL          (*(unsigned char volatile far *)0x7ef559)
#define     DMA_CAN2R_FRM           (*(unsigned char volatile far *)0x7ef55b)
#define     DMA_CAN2R_FCNTH         (*(unsigned char volatile far *)0x7ef55c)
#define     DMA_CAN2R_FCNTL         (*(unsigned char volatile far *)0x7ef55d)

